# WireMaterialTypes Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ElectricalSetting..::..WireMaterialTypes Property
ElectricalSetting Class See Also
---
Get electrical wire material types information of the project.
**Namespace:** Autodesk.Revit.DB.Electrical**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public WireMaterialTypeSet WireMaterialTypes { get; }
```

Visual Basic
---
```text
Public ReadOnly Property WireMaterialTypes As WireMaterialTypeSet
	Get
```

Visual C++
---
```text
public:
property WireMaterialTypeSet^ WireMaterialTypes {
	WireMaterialTypeSet^ get ();
}
```

# See Also
ElectricalSetting Class
Autodesk.Revit.DB.Electrical Namespace